Revit 2024 API
ExternalServices.BuiltInExternalServices.GenericRepoHelperService Property
 Unique service id.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId GenericRepoHelperService { get; }
Visual Basic
Public Shared ReadOnly Property GenericRepoHelperService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ GenericRepoHelperService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace